CUISINE_INFO = {
    'russia': ('/static/img/cuisine/russia.png', 'Русская кухня – одна из самых интересных национальных кухонь в мире.'
                                             ' Она привлекает многих, в первую очередь, своим необычайным национальным'
                                             ' колоритом. Такие блюда, как щи, каши, пироги, блины, а также квас,'
                                             ' сбитень, считаются исконно русскими. Русская кухня является очень сытной'
                                             ' и в то же время очень здоровой.'),
    'france': ('/static/img/cuisine/france.png', 'Традиционная кухня Франции основана на простых продуктах, из которых'
                                             ' создаются сложные блюда. Креветки и лобстеры, разнообразие видов рыбы,'
                                             ' много мясных блюд, овощи. И, конечно же, великолепные французские сыры,'
                                             ' от знаменитых рокфора и камамбера до козьих сыров деревень Лангедока.'),
    'georgia': ('/static/img/cuisine/georgia.png', 'Грузинская кухня — это симбиоз вкусностей: удачно объединенного мяса и'
                                              ' овощей, приправленных огромным количеством разнообразных специй. Здесь'
                                              ' можно смело забыть о своей диете и просто наслаждаться вкусной пищей.'),
    'italia': ('/static/img/cuisine/italia.png', 'Итальянская кухня по праву считается одной из лучших в мире,'
                                             ' да и сами итальянцы считают ее не меньшей достопримечательностью,'
                                             ' чем Колизей или Пизанская башня.'),
    'japan': ('/static/img/cuisine/japan.png', 'Обилие морепродуктов, зелени, риса – блюда японской кухни отличаются этими'
                                            ' главными характеристиками. Здесь в готовке важно не только правильное'
                                            ' сочетание продуктов, но и их грамотное приготовление и сочетание.'
                                            ' Процесс создания блюда не менее важен, чем покупка качественных ингредиентов.'),
    'india': ('/static/img/cuisine/india.png', 'Индийская кухня вобрала в себя 8000-летний опыт взаимодействия с разными'
                                             ' народами и культурами, что привело в итоге к тому многообразию вкусов и блюд,'
                                             ' которые можно найти в Индии сегодня. Позднее торговля с Великобританией'
                                             ' и Португалией только добавила красок в уже сложившуюся яркую и разнообразную'
                                             ' палитру индийской кухни.'),
    'china': ('/static/img/cuisine/china.png', 'Отличительная особенность китайской кухни – сбалансированность продуктов'
                                             ' (овощей, специй, приправ). Поэтому блюда имеют неповторимый аромат,'
                                             ' вкус и цвет. Гармоничное единство овощей, специй и приправ издавна'
                                             ' считалось основой кулинарного искусства Китая.'),
    'asia': ('/static/img/cuisine/asia.png', 'Азиатская кухня – кухня очень древняя, богатая давними традициями,'
                                           ' которые старательно хранятся и передаются из поколения в поколение.'),
    'mexico': ('/static/img/cuisine/mexico.png', 'Национальная кухня Мексики – это смесь ацтекских и испанских кулинарных'
                                             ' традиций. До прихода конкистадоров основу местной стряпни составляли'
                                             ' кукуруза, фасоль, мясо птицы, жгучий перец чили, разнообразные специи,'
                                             ' мексиканский кактус и помидоры.'),
    'europe': ('/static/img/cuisine/euro.png', 'Европейская кухня неоднородна. Она охватывает множество национальных блюд,'
                                            ' отличающихся по составу ингредиентов и технике их приготовления.'),
    'caucasus': ('/static/img/cuisine/caucas.png', 'Кавказская кухня широко использует в своих рецептах различные виды мяса.'
                                              ' Чаще всего повара кладут в блюда телятину, баранину и говядину. '),
    'uzbekistan': ('/static/img/cuisine/uzbec.png', 'Характерными особенностями узбекской национальной кухни является высокая'
                                            ' калорийность, использование большого количества масла и сала, а также'
                                            ' специй, приправ и зелени.'),
    'turkey': ('/static/img/cuisine/turky.png', 'Турецкая кухня известна во всем мире своим разнообразием и полным вкусом,'
                                            ' на который повлияла ее богатая история, и каждый регион страны сегодня'
                                            ' славит свои фирменные блюда.'),
    'america': ('/static/img/cuisine/america.png', 'Американская кухня — одна из самых необычных. Сложно найти страну с'
                                               ' таким смешением различных культур, отразившихся в блюдах.'
                                               ' Блюда американской кухни — это пища, перенятая от местных индейцев,'
                                               ' перемешавшаяся с кухней первых переселенцев.'),
    'spain': ('/static/img/cuisine/spain.png', 'Главная особенность испанской кухни— преобладание в составе национальных'
                                            ' блюд мяса, рыбы и морепродуктов. Именно на их основе готовятся знаменитые'
                                            ' тортилья, паэлья и множество иных кушаний'),
    'greece': ('/static/img/cuisine/greek.png', 'У греческой кухни есть четыре секрета: свежие, высококачественные'
                                             ' продукты, мудрое использование трав и пряностей, знаменитое греческое'
                                             ' оливковое масло и основополагающая простота рецептов.')
}

DEP_INFO = {
    'bakery': '/static/img/departments/bakery.png',
    'desserts': '/static/img/departments/deserts.png',
    'main_dishes': '/static/img/departments/main_dish.png',
    'snacks': '/static/img/departments/sandwich.png',
    'salads': '/static/img/departments/salad.png',
    'soups': '/static/img/departments/soup.png',
    'drinks': '/static/img/departments/drink.png',
    'sauces': '/static/img/departments/sous.png',
    'canned': '/static/img/departments/jar.png'
}

MENU = [
    {'menu_title': 'Домашняя страница', 'm_url': "home"},
    {'menu_title': 'Рецепты', 'dropdown': [
        {'name': 'Все рецепты', 'm_url': 'recipes'},
        {'name': 'Салаты', 'm_url': 'dep_recipes', 'dep': 'salads'},
        {'name': 'Первые блюда', 'm_url': 'dep_recipes', 'dep': 'soups'},
        {'name': 'Вторые блюда', 'm_url': 'dep_recipes', 'dep': 'main_dishes'},
        {'name': 'Закуски', 'm_url': 'dep_recipes', 'dep': 'snacks'},
        {'name': 'Выпечка', 'm_url': 'dep_recipes', 'dep': 'bakery'},
        {'name': 'Десерты', 'm_url': 'dep_recipes', 'dep': 'desserts'},
        {'name': 'Напитки', 'm_url': 'dep_recipes', 'dep': 'drinks'},
        {'name': 'Соусы', 'm_url': 'dep_recipes', 'dep': 'sauces'},
        {'name': 'Заготовки на зиму', 'm_url': 'dep_recipes', 'dep': 'canned'},
    ]},
    {'menu_title': 'Кухни мира', 'dropdown': [
        {'name': 'Все кухни', 'm_url': 'cuisines'},
        {'name': 'Русская кухня', 'm_url': 'cus_recipes', 'cntr': 'russia'},
        {'name': 'Французская кухня', 'm_url': 'cus_recipes', 'cntr': 'france'},
        {'name': 'Грузинская кухня', 'm_url': 'cus_recipes', 'cntr': 'georgia'},
        {'name': 'Итальянская кухня', 'm_url': 'cus_recipes', 'cntr': 'italia'},
        {'name': 'Японская кухня', 'm_url': 'cus_recipes', 'cntr': 'japan'},
        {'name': 'Индийская кухня', 'm_url': 'cus_recipes', 'cntr': 'india'},
        {'name': 'Китайская кухня', 'm_url': 'cus_recipes', 'cntr': 'china'},
        {'name': 'Азиатская кухня', 'm_url': 'cus_recipes', 'cntr': 'asia'},
        {'name': 'Мексиканская кухня', 'm_url': 'cus_recipes', 'cntr': 'mexico'},
        {'name': 'Европейская кухня', 'm_url': 'cus_recipes', 'cntr': 'europe'},
        {'name': 'Кавказская кухня', 'm_url': 'cus_recipes', 'cntr': 'caucasus'},
        {'name': 'Узбекская кухня', 'm_url': 'cus_recipes', 'cntr': 'uzbekistan'},
        {'name': 'Турецкая кухня', 'm_url': 'cus_recipes', 'cntr': 'turkey'},
        {'name': 'Американская кухня', 'm_url': 'cus_recipes', 'cntr': 'america'},
        {'name': 'Испанская кухня', 'm_url': 'cus_recipes', 'cntr': 'spain'},
        {'name': 'Греческая кухня', 'm_url': 'cus_recipes', 'cntr': 'greece'},
    ]},
    {'menu_title': 'Ингредиенты', 'm_url': "goods"},
    {'menu_title': 'Блог', 'm_url': 'home'},
    {'menu_title': 'О нас', 'm_url': 'home'},
]


class DataMixin:
    def get_user_context(self, **kwargs):
        context = kwargs
        context['menu'] = MENU
        return context
